In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("D:/PythonProject/webformyself/25_files/price.csv", sep=';')
df

    id                                              title price
0    1  Ноутбук Acer Aspire 5 A515-54G-502N (NX.HVGEU....   10$
1    2  Ноутбук Asus ROG Strix G15 G512LI-HN057 (90NR0...   11$
2    3  Ноутбук HP Pavilion Gaming 15-bc504ur (7DT87EA...    7$
3    4  Ноутбук HP Pavilion Notebook 15-cw1011ua (8RW1...   25$
4    5  Ноутбук Acer Aspire 7 A715-41G-R7MZ (NH.Q8LEU....   35$
5    6  Ноутбук Dell Inspiron 3582 (I3582C54H5NIL-BK) ...    5$
6    7  Ноутбук Apple MacBook Air 13" 256GB 2020 Space...   11$
7    8  Ноутбук Asus ROG Strix G15 G512LI-HN094 (90NR0...   16$
8    9  Ноутбук HP Pavilion Notebook 15-cw1002ua (7KE5...   15$
9   10  Ноутбук HP Pavilion Notebook 15-cw1005ua (7ZF7...   20$
10  11  Ноутбук Lenovo IdeaPad L340-15IRH Gaming (81LK...   10$

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      11 non-null     int64
 1   title   11 non-null     object
 2   price   11 non-null     object
dtypes: int64(1), object(2)
memory usage: 396.0+ bytes

object - это тип строка. Для цены не подходит. Необходимо изменить тип.

In [5]:
df.dtypes

id        int64
title    object
price    object
dtype: object

In [8]:
df['price'] = df.price.str.replace('$', '')

In [9]:
df

    id                                              title price
0    1  Ноутбук Acer Aspire 5 A515-54G-502N (NX.HVGEU....    10
1    2  Ноутбук Asus ROG Strix G15 G512LI-HN057 (90NR0...    11
2    3  Ноутбук HP Pavilion Gaming 15-bc504ur (7DT87EA...     7
3    4  Ноутбук HP Pavilion Notebook 15-cw1011ua (8RW1...    25
4    5  Ноутбук Acer Aspire 7 A715-41G-R7MZ (NH.Q8LEU....    35
5    6  Ноутбук Dell Inspiron 3582 (I3582C54H5NIL-BK) ...     5
6    7  Ноутбук Apple MacBook Air 13" 256GB 2020 Space...    11
7    8  Ноутбук Asus ROG Strix G15 G512LI-HN094 (90NR0...    16
8    9  Ноутбук HP Pavilion Notebook 15-cw1002ua (7KE5...    15
9   10  Ноутбук HP Pavilion Notebook 15-cw1005ua (7ZF7...    20
10  11  Ноутбук Lenovo IdeaPad L340-15IRH Gaming (81LK...    10

In [12]:
df.dtypes

id        int64
title    object
price    object
dtype: object

In [16]:
df.price.astype('int32')

0     10
1     11
2      7
3     25
4     35
5      5
6     11
7     16
8     15
9     20
10    10
Name: price, dtype: int32

In [20]:
df['price'] = df.price.astype('uint32')
df

    id                                              title  price
0    1  Ноутбук Acer Aspire 5 A515-54G-502N (NX.HVGEU....     10
1    2  Ноутбук Asus ROG Strix G15 G512LI-HN057 (90NR0...     11
2    3  Ноутбук HP Pavilion Gaming 15-bc504ur (7DT87EA...      7
3    4  Ноутбук HP Pavilion Notebook 15-cw1011ua (8RW1...     25
4    5  Ноутбук Acer Aspire 7 A715-41G-R7MZ (NH.Q8LEU....     35
5    6  Ноутбук Dell Inspiron 3582 (I3582C54H5NIL-BK) ...      5
6    7  Ноутбук Apple MacBook Air 13" 256GB 2020 Space...     11
7    8  Ноутбук Asus ROG Strix G15 G512LI-HN094 (90NR0...     16
8    9  Ноутбук HP Pavilion Notebook 15-cw1002ua (7KE5...     15
9   10  Ноутбук HP Pavilion Notebook 15-cw1005ua (7ZF7...     20
10  11  Ноутбук Lenovo IdeaPad L340-15IRH Gaming (81LK...     10

In [23]:
df.dtypes

id        int64
title    object
price    uint32
dtype: object

Второй способ изменения типа:

In [24]:
df = pd.read_csv("D:/PythonProject/webformyself/25_files/price.csv", sep=';')
df

    id                                              title price
0    1  Ноутбук Acer Aspire 5 A515-54G-502N (NX.HVGEU....   10$
1    2  Ноутбук Asus ROG Strix G15 G512LI-HN057 (90NR0...   11$
2    3  Ноутбук HP Pavilion Gaming 15-bc504ur (7DT87EA...    7$
3    4  Ноутбук HP Pavilion Notebook 15-cw1011ua (8RW1...   25$
4    5  Ноутбук Acer Aspire 7 A715-41G-R7MZ (NH.Q8LEU....   35$
5    6  Ноутбук Dell Inspiron 3582 (I3582C54H5NIL-BK) ...    5$
6    7  Ноутбук Apple MacBook Air 13" 256GB 2020 Space...   11$
7    8  Ноутбук Asus ROG Strix G15 G512LI-HN094 (90NR0...   16$
8    9  Ноутбук HP Pavilion Notebook 15-cw1002ua (7KE5...   15$
9   10  Ноутбук HP Pavilion Notebook 15-cw1005ua (7ZF7...   20$
10  11  Ноутбук Lenovo IdeaPad L340-15IRH Gaming (81LK...   10$

In [28]:
df.dtypes

id        int64
title    object
price    object
dtype: object

In [29]:
df['price'] = df.price.str.replace('$', '')
df

    id                                              title price
0    1  Ноутбук Acer Aspire 5 A515-54G-502N (NX.HVGEU....    10
1    2  Ноутбук Asus ROG Strix G15 G512LI-HN057 (90NR0...    11
2    3  Ноутбук HP Pavilion Gaming 15-bc504ur (7DT87EA...     7
3    4  Ноутбук HP Pavilion Notebook 15-cw1011ua (8RW1...    25
4    5  Ноутбук Acer Aspire 7 A715-41G-R7MZ (NH.Q8LEU....    35
5    6  Ноутбук Dell Inspiron 3582 (I3582C54H5NIL-BK) ...     5
6    7  Ноутбук Apple MacBook Air 13" 256GB 2020 Space...    11
7    8  Ноутбук Asus ROG Strix G15 G512LI-HN094 (90NR0...    16
8    9  Ноутбук HP Pavilion Notebook 15-cw1002ua (7KE5...    15
9   10  Ноутбук HP Pavilion Notebook 15-cw1005ua (7ZF7...    20
10  11  Ноутбук Lenovo IdeaPad L340-15IRH Gaming (81LK...    10

In [33]:
pd.to_numeric(df.price, downcast='float')

0     10.0
1     11.0
2      7.0
3     25.0
4     35.0
5      5.0
6     11.0
7     16.0
8     15.0
9     20.0
10    10.0
Name: price, dtype: float32

In [3]:
import numpy as np

In [41]:
np.iinfo(df.price)

ValueError: Invalid integer data type 'O'.

Тип Category для НЕуникальных строковых значений

In [5]:
df = pd.read_csv("D:/PythonProject/webformyself/city.csv", sep=';')
df

        ID            Name CountryCode       District  Population
0        1           Kabul         AFG          Kabol     1780000
1        2        Qandahar         AFG       Qandahar      237500
2        3           Herat         AFG          Herat      186800
3        4  Mazar-e-Sharif         AFG          Balkh      127800
4        5       Amsterdam         NLD  Noord-Holland      731200
...    ...             ...         ...            ...         ...
4074  4075      Khan Yunis         PSE     Khan Yunis      123175
4075  4076          Hebron         PSE         Hebron      119401
4076  4077        Jabaliya         PSE     North Gaza      113901
4077  4078          Nablus         PSE         Nablus      100231
4078  4079           Rafah         PSE          Rafah       92020

[4079 rows x 5 columns]

In [6]:
df.District.nunique()

1366

In [7]:
df.CountryCode.nunique()

232

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4079 entries, 0 to 4078
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID           4079 non-null   int64
 1   Name         4079 non-null   object
 2   CountryCode  4079 non-null   object
 3   District     4075 non-null   object
 4   Population   4079 non-null   int64
dtypes: int64(2), object(3)
memory usage: 159.5+ KB

In [9]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4079 entries, 0 to 4078
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID           4079 non-null   int64
 1   Name         4079 non-null   object
 2   CountryCode  4079 non-null   object
 3   District     4075 non-null   object
 4   Population   4079 non-null   int64
dtypes: int64(2), object(3)
memory usage: 744.9 KB

In [10]:
df.memory_usage()

Index            132
ID             32632
Name           32632
CountryCode    32632
District       32632
Population     32632
dtype: int64

In [11]:
df.memory_usage(deep=True)

Index             132
ID              32632
Name           241922
CountryCode    212108
District       243311
Population      32632
dtype: int64

In [12]:
df.memory_usage(deep=True).sum()

np.int64(762737)

In [13]:
df['CountryCode']= df.CountryCode.astype('category')

In [14]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4079 entries, 0 to 4078
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID           4079 non-null   int64
 1   Name         4079 non-null   object
 2   CountryCode  4079 non-null   category
 3   District     4075 non-null   object
 4   Population   4079 non-null   int64
dtypes: category(1), int64(2), object(2)
memory usage: 565.6 KB

In [15]:
df.memory_usage(deep=True)

Index             132
ID              32632
Name           241922
CountryCode     28518
District       243311
Population      32632
dtype: int64

In [16]:
df2 = pd.read_csv("D:/PythonProject/webformyself/city.csv", sep=';')
df2

        ID            Name CountryCode       District  Population
0        1           Kabul         AFG          Kabol     1780000
1        2        Qandahar         AFG       Qandahar      237500
2        3           Herat         AFG          Herat      186800
3        4  Mazar-e-Sharif         AFG          Balkh      127800
4        5       Amsterdam         NLD  Noord-Holland      731200
...    ...             ...         ...            ...         ...
4074  4075      Khan Yunis         PSE     Khan Yunis      123175
4075  4076          Hebron         PSE         Hebron      119401
4076  4077        Jabaliya         PSE     North Gaza      113901
4077  4078          Nablus         PSE         Nablus      100231
4078  4079           Rafah         PSE          Rafah       92020

[4079 rows x 5 columns]

In [18]:
df2.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4079 entries, 0 to 4078
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID           4079 non-null   int64
 1   Name         4079 non-null   object
 2   CountryCode  4079 non-null   object
 3   District     4075 non-null   object
 4   Population   4079 non-null   int64
dtypes: int64(2), object(3)
memory usage: 744.9 KB

In [21]:
%%timeit
df2.groupby('CountryCode').count()

949 μs ± 21.3 μs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [25]:
df.CountryCode.cat.codes

0         1
1         1
2         1
3         1
4       153
       ...
4074    171
4075    171
4076    171
4077    171
4078    171
Length: 4079, dtype: int16

In [26]:
df.CountryCode.cat.categories

Index(['ABW', 'AFG', 'AGO', 'AIA', 'ALB', 'AND', 'ANT', 'ARE', 'ARG', 'ARM',
       ...
       'VIR', 'VNM', 'VUT', 'WLF', 'WSM', 'YEM', 'YUG', 'ZAF', 'ZMB', 'ZWE'],
      dtype='object', length=232)

In [28]:
df3= pd.DataFrame({
    'name': ['Jenny', 'Paul', 'Cathy', 'John'],
    'mark': ['good', 'excelent', 'middle', 'good']
})
df3

    name      mark
0  Jenny      good
1   Paul  excelent
2  Cathy    middle
3   John      good

In [30]:
def get_mark(v):
    if v == 'excelent':
        return 5
    elif v == 'good':
        return 4
    if v == 'middle':
        return 3
    else:
        return 2

df3['rate'] = df3.mark.apply(get_mark)
df3

    name      mark  rate
0  Jenny      good     4
1   Paul  excelent     5
2  Cathy    middle     3
3   John      good     4

In [32]:
df3[df3.rate > 3]

    name      mark  rate
0  Jenny      good     4
1   Paul  excelent     5
3   John      good     4

In [33]:
df3= pd.DataFrame({
    'name': ['Jenny', 'Paul', 'Cathy', 'John'],
    'mark': ['good', 'excelent', 'middle', 'good']
})
df3

    name      mark
0  Jenny      good
1   Paul  excelent
2  Cathy    middle
3   John      good

In [36]:
# Второй способ:
d_mark = {'good' : 4, 'excelent': 5, 'middle': 3}
df3['rate'] = df3.mark.map(d_mark)
df3

    name      mark  rate
0  Jenny      good     4
1   Paul  excelent     5
2  Cathy    middle     3
3   John      good     4

In [38]:
df3= pd.DataFrame({
    'name': ['Jenny', 'Paul', 'Cathy', 'John'],
    'mark': ['bad', 'excelent', 'middle', 'good']
})
df3

    name      mark
0  Jenny       bad
1   Paul  excelent
2  Cathy    middle
3   John      good

In [40]:
df3['mark'] = pd.Categorical(df3.mark, categories=['bad', 'middle', 'good', 'excelent'], ordered=True)

In [41]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   mark    4 non-null      category
dtypes: category(1), object(1)
memory usage: 372.0+ bytes

In [43]:
df3.mark

0         bad
1    excelent
2      middle
3        good
Name: mark, dtype: category
Categories (4, object): ['bad' < 'middle' < 'good' < 'excelent']

In [44]:
df3[df3.mark > 'middle'].sort_values(by='mark', ascending=False)

   name      mark
1  Paul  excelent
3  John      good

DateTime

In [60]:
 df = pd.DataFrame({
     "date": ['01.01.2008',
              '02.02.2009',
              '03.03.2010',
              '04.04.2011']
 })
df

         date
0  01.01.2008
1  02.02.2009
2  03.03.2010
3  04.04.2011

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    4 non-null      object
dtypes: object(1)
memory usage: 164.0+ bytes

In [47]:
pd.to_datetime('30.11.2020')

C:\Users\Yevheniia\AppData\Local\Temp\ipykernel_11632\1323499417.py:1: UserWarning: Parsing dates in %d.%m.%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  pd.to_datetime('30.11.2020')

Timestamp('2020-11-30 00:00:00')

In [48]:
pd.to_datetime('12.11.2020')

Timestamp('2020-12-11 00:00:00')

In [49]:
pd.to_datetime('12.11.2020', dayfirst=True)

Timestamp('2020-11-12 00:00:00')

In [51]:
pd.to_datetime('12.11.2020', format='%d.%m.%Y')

Timestamp('2020-11-12 00:00:00')

In [52]:
pd.to_datetime('12.11.2020', format='%d.%m.%Y').month

11

In [53]:
pd.to_datetime('12.11.2020', format='%d.%m.%Y').year

2020

In [54]:
df

         date
0  01.01.2008
1  02.02.2009
2  03.03.2010
3  04.04.2011

In [55]:
df.dtypes

date    object
dtype: object

In [64]:
df['dates'] = pd.to_datetime(df.date, format='%d.%m.%Y')
df

         date      dates
0  01.01.2008 2008-01-01
1  02.02.2009 2009-02-02
2  03.03.2010 2010-03-03
3  04.04.2011 2011-04-04

In [63]:
df.dtypes

date             object
dates    datetime64[ns]
dtype: object

In [65]:
df.dates.dt.day_name()

0      Tuesday
1       Monday
2    Wednesday
3       Monday
Name: dates, dtype: object

In [66]:
df[df.dates.dt.day > 2]

         date      dates
2  03.03.2010 2010-03-03
3  04.04.2011 2011-04-04

In [67]:
df.dates.max()

Timestamp('2011-04-04 00:00:00')

In [68]:
df.dates.min()

Timestamp('2008-01-01 00:00:00')

In [69]:
df.dates.max() - df.dates.min()

Timedelta('1189 days 00:00:00')

In [ ]:
df[df.dates ]